---
kind: method
id: M:Autodesk.Revit.DB.Subelement.GetAllParameters
source: html/f7ee81cc-3a1c-08c8-b495-c562968010cd.htm
---
# Autodesk.Revit.DB.Subelement.GetAllParameters Method

Returns all parameters of this subelement.

## Syntax (C#)
```csharp
public IList<ElementId> GetAllParameters()
```